Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: དྲན་པ་སྔོན་དུ་འགྲོ་བས་ཆོས་ཐམས་ཅད་ལ་སྣང་བ་ཐོབ་པ་ཡིན་ཏེ
en: Finally, on the strength of the preceding types of mindfulness, one reaches illumination with respect to all Dharma teachings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པའི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་གོ། །
en: Son of noble family, those are the eight bodhisattva illuminations of mindfulness.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བློ་གྲོས་ཀྱི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight bodhisattva illuminations of intelligence:

source: དོན་གྱི་བློ་གྲོས་ཡིན་གྱི་ཚིག་འབྲུའི་བློ་གྲོས་མ་ཡིན་པ་དང་། ཡེ་ཤེས་ཀྱི་བློ་གྲོས་ཡིན་གྱི་རྣམ་པར་ཤེས་པའི་བློ་གྲོས་མ་ཡིན་པ་དང་། ཆོས་ཀྱི་བློ་གྲོས་ཡིན་གྱི་ཉོན་མོངས་པའི་བློ་གྲོས་མ་ཡིན་པ་དང་། རིག་པའི་བློ་གྲོས་ཡིན་གྱི་འགལ་བའི་བློ་གྲོས་མ་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་བློ་གྲོས་ཡིན་གྱི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་བློ་གྲོས་མ་ཡིན་པ་དང་། རླབས་པོ་ཆེའི་བློ་གྲོས་ཡིན་གྱི་དམན་པའི་བློ་གྲོས་མ་ཡིན་པ་དང་། སངས་རྒྱས་ཀྱི་བློ་གྲོས་ཡིན་གྱི་བདུད་ཀྱི་བློ་གྲོས་མ་ཡིན་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་བློ་གྲོས་ཡིན་གྱི་སེམས་ཅན་ལ་རྣམ་པར་འཚེ་བའི་བློ་གྲོས་མ་ཡིན་པ་སྟེ།
en: intelligence with regard to meaning rather than words or syllables, intelligent wisdom rather than intelligent consciousness, intelligence involving Dharma instead of afflictive emotions, intelligence involving reason instead of what is contrary to reason, the intelligence of bodhicitta rather than the intelligence of a śrāvaka or pratyekabuddha, tremendous intelligence rather than lesser intelligence, the intelligence of a buddha instead of the intelligence of Māra, and compassionate intelligence instead of intelligence that is hostile toward sentient beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྟོགས་པའི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight bodhisattva illuminations of comprehension:

source: ཆོས་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། དགོངས་ཏེ་བསྟན་པ་རྣམས་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། སེམས་ཅན་གྱི་བསམ་པ་རྣམས་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་ཤེས་པ་རྣམས་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོ་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། སྣྲེལ་ཞིའི་རྒྱུད་བསྟན་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། སྤྱིའུ་ཚུགས་ཀྱི་རྒྱུད་བསྟན་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་སྟེ།
en: gaining comprehension of all teachings, of the underlying intent of what was taught, of the dispositions of beings, of the knowledge of the types of discriminating knowledge, of profound dependent arising, of the teachings via nonsequential progression, of the teachings via reverse progression, and of all the qualities of the Buddha.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight bodhisattva illuminations of phenomena:

source: སེམས་ཅན་རྣམས་ལ་ལས་ཀྱི་བྱ་བ་ལ་འཇུག་པ་སྟོན་པས་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་སྣང་བ་དང་། ཐར་པ་འདོད་པ་རྣམས་ལ་ཤེས་རབ་ཀྱིས་སྟོན་པས་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྣང་བ་དང་། ལམ་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་སྒྲིབ་པ་མེད་པའི་ཆོས་ཀྱི་སྣང་བ་དང་། འདོད་པ་དང་། སྲིད་པ་དང་། མ་རིག་པ་དང་། ལྟ་བའི་ཟག་པ་མི་སློང་བའི་ཕྱིར་ཟག་པ་མེད་པའི་ཆོས་ཀྱི་སྣང་བ་དང་། འཕགས་པ་རྣམས་ཀྱི་ངེས་པར་གྱུར་པ་མངོན་སུམ་དུ་བྱེད་པའི་ཕྱིར་འདུས་མ་བྱས་པའི་ཆོས་ཀྱི་སྣང་བ་དང་། གློ་བུར་གྱི་ཉོན་མོངས་པ་ལ་ཤིན་ཏུ་རྟོགས་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཀྱི་སྣང་བ་དང་། སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཕྱིར་རྣམ་པར་བྱང་བའི་ཆོས་ཀྱི་སྣང་བ་དང་། ཆོས་རྣམས་ཤིན་ཏུ་ཉེ་བར་ཞི་བའི་ཕྱིར་མྱ་ངན་ལས་འདས་པའི་ཆོས་ཀྱི་སྣང་བ་སྟེ།
en: the illuminations of mundane factors through teaching sentient beings to engage in appropriate deeds; of supramundane factors through insightfully teaching those who wish for liberation; of unobscured factors since they have cultivated the path; of uncontaminated factors since they do not take up the defilements of desire, existence, ignorance, or views; of unconditioned factors since they have accomplished the certainty of the noble ones; of factors of pollution since they comprehend well the adventitious afflictive emotions; of factors of purification since their minds are naturally luminous; and of the factors of nirvāṇa since phenomena are totally pacified.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པའི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight bodhisattva illuminations of knowledge:

source: བརྒྱད་པའི་ཤེས་པའི་སྣང་བ་དང་། རྒྱུན་དུ་ཞུགས་པའི་ཤེས་པའི་སྣང་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་ཤེས་པའི་སྣང་བ་དང་། ཕྱིར་མི་འོང་བའི་ཤེས་པའི་སྣང་བ་དང་། དགྲ་བཅོམ་པའི་ཤེས་པའི་སྣང་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཤེས་པའི་སྣང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཤེས་པའི་སྣང་བ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་མཁྱེན་པའི་སྣང་བ་སྟེ།
en: the illuminations of knowledge of someone who has eight existences remaining, a stream enterer, a once-returner, a non-returner, an arhat, a pratyekabuddha, a bodhisattva, and a fully awakened buddha.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པའི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight bodhisattva illuminations of truth:

source: བདེན་པ་བསྒོམ་པ་གང་གིས་ངེས་པར་གྱུར་པ་ལ་འཇུག་པ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་འབྲས་བུ་དང་པོ་འཐོབ་པར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་འབྲས་བུ་གཉིས་པ་འཐོབ་པར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་འབྲས་བུ་གསུམ་པ་འཐོབ་པར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་འབྲས་བུ་བཞི་པ་འཐོབ་པར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་རང་སངས་རྒྱས་ཉིད་འཐོབ་པར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་རབ་ཏུ་འཐོབ་པར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་དང་། བདེན་པ་བསྒོམ་པ་གང་གིས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ལ་དེའི་སྣང་བ་སྟེ།
en: the illuminations of the cultivation of the truth by which they enter a state of certainty, by which they attain the first fruition, by which they attain the second fruition, by which they attain the third fruition, by which they attain the fourth fruition, by which they attain pratyekabuddhahood, by which they attain the acceptance of a bodhisattva, and by which they completely and perfectly awaken to the awakening of a buddha.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་ཤེས་པའི་སྣང་བ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight bodhisattva illuminations of superknowledge:

source: ལྷའི་མིག་གིས་གཟུགས་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བའི་ཕྱིར་གསལ་བའི་སྣང་བ་དང་། ལྷའི་རྣ་བས་སྒྲ་ཐམས་ཅད་ཐོས་པའི་ཕྱིར་ངེས་པར་རྟོགས་པའི་སྣང་བ་དང་། སྔོན་གྱི་གནས་བསྐལ་པ་གྲངས་མེད་པ་རྗེས་སུ་དྲན་པའི་ཕྱིར་རྗེས་སུ་དྲན་པའི་སྣང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ལྟ་བའི་ཕྱིར་རང་བཞིན་གྱིས་འོད་གསལ་བའི་སྣང་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བའི་ཕྱིར་ནམ་མཁའ་སྒྲིབ་པ་མེད་པའི་སྣང་བ་དང་། ཟག་པ་མེད་པའི་ཤེས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཕྱིར་ཤེས་པའི་སྣང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བའི་ཕྱིར་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་སྣང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོགས་པ་གཅོད་པའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་སྣང་བ་སྟེ།
en: the illuminations of clarity because bodhisattvas see all forms with the divine eye, of comprehension because they hear all sounds with the divine ear, of recollection because they recollect countless eons of previous existences, of natural luminosity because they gaze upon the minds of all beings, of the unobscured sky because they move by miraculous power through boundless buddhafields, of knowledge because they accomplish a knowledge that is free of defilements, of the accumulation of merit because they sustain all beings, and of the accumulation of wisdom because they eliminate the doubts of all sentient beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲུབ་པའི་སྣང་བ་ནི་དགུ་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are nine bodhisattva illuminations of accomplishment:

source: སྒྲུབ་པས་ཡེ་ཤེས་ཀྱི་སྣང་བ་དང་། སྒྲུབ་པས་ཤེས་རབ་ཀྱི་སྣང་བ་དང་། སྒྲུབ་པས་བློའི་སྣང་བ་དང་། སྒྲུབ་པས་ཡང་དག་པའི་ལྟ་བའི་སྣང་བ་དང་། སྒྲུབ་པས་ཞི་གནས་ཀྱི་སྣང་བ་དང་། སྒྲུབ་པས་ལྷག་མཐོང་གི་སྣང་བ་དང་། སྒྲུབ་པས་སེམས་ཅན་གྱི་བསམ་པའི་སྣང་བ་དང་། སྒྲུབ་པས་འཁྲུགས་པ་མེད་པར་སེམས་རྣམ་པར་གྲོལ་བའི་སྣང་བ་དང་། སྒྲུབ་པས་ཤིན་ཏུ་མཐར་ཐུག་པའི་སྣང་བ་སྣང་བ་སྟེ།
en: the illuminations through accomplishment of wisdom, insight, understanding, correct view, tranquil abiding, special insight, the intentions of beings, a liberated mind that is unperturbed, and the final illumination.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, the Blessed One spoke the following verses:

source: དྲན་པ་དེ་དང་ཡང་དག་འདྲེས་པ་ནི། །སྔོན་ཆད་ལས་དགེ་བསགས་པ་ཆུད་མི་གཟོན། །
en: “Bodhisattvas imbued with mindfulness Do not waste the roots of virtue accumulated in the past.

source: ཕྲ་བར་སྔོ་བ་ཕུན་སུམ་ཚོགས་པ་དེ། །ཕྱི་ཕྱིར་ཞིང་ནི་ཡང་དག་སྒྲུབ་པར་བྱེད། །
en: Their excellence in subtle dedication Accomplishes buddhafields for the sake of the future.

source: ཐོས་པའི་ཆོས་རྣམས་ལ་ནི་བརྗེད་པ་མེད། །རྣམ་པར་ངེས་པ་མྱུར་དུ་འཐོབ་པར་འགྱུར། །
en: “They never forget the teachings they have heard, And they swiftly reach a state of certainty.

source: ཉེ་བར་ཞི་བས་ཡུལ་རྣམས་ལས་ནི་སྦས། །
en: At peace, they are shielded from the sense objects.

source: དྲན་དང་ལྡན་པ་མི་དགེ་རྣམས་དང་བྲལ། །
en: Endowed with mindfulness, they are freed from nonvirtue.

source: དྲན་པ་རྒྱ་བོ་ཆེ་ནི་ཤིན་ཏུ་བསགས། །བྱ་བ་བྱ་བ་དག་ནི་རྣམ་པར་འབྱེད། །
en: Having accumulated vast mindfulness, They discern which actions are to be performed.

source: དྲན་པ་དག་དང་ལྡན་པར་རིག་ནས་ནི། །རྒྱལ་བ་རང་བྱུང་དག་གི་བྱིན་གྱིས་རློབ། །
en: “With the blessing of the self-arisen victors Who know that they are endowed with mindfulness,

source: དམ་པའི་ཆོས་ཀྱི་གྲོང་ཁྱེར་སྐྱོང་བྱེད་པ། །དེ་ནི་འགྲོ་བ་རྣམས་ལ་ཆོས་སྟོན་ནུས། །
en: The bodhisattvas guard the city of the noble Dharma And teach Dharma to beings.

source: ཤེས་རབ་ལྡན་པ་མུན་པ་རྣམ་བྲལ་ཏེ། །ལྷ་དང་མི་རྣམས་ཀྱི་ནི་དོན་ཀྱང་བྱེད། །
en: “Endowed with wisdom and separated from gloom, They accomplish the benefit of gods and humans.

source: བློ་གྲོས་བཟང་ལྡན་སྣང་བ་ཐོབ་གྱུར་ནས། །དོགས་པ་དང་ནི་ཐེ་ཙོམ་རྣམས་ཀྱང་གཅོད། །
en: Having attained the illumination of excellent intelligence, They eliminate doubts and hesitations.

source: དྲན་དང་ལྡན་པ་རང་འབྱུང་ཡེ་ཤེས་ཀྱིས། །བྱང་ཆུབ་མྱུར་དུ་རྗེས་སུ་རྟོགས་པར་བྱེད། །
en: Endowed with mindfulness, their spontaneous wisdom Brings swift realization of awakening.

source: དེ་ནི་དོན་གྱི་བློ་གྲོས་ཅན་ཡིན་གྱི། །ཚིག་འབྲུའི་རྗེས་སུ་མི་རྒྱུག་སྒྲ་ལའང་མིན། །
en: “Bodhisattvas are endowed with intelligence regarding meaning Rather than words, letters, or grammar.

source: སེམས་ཅན་དག་པ་ཡེ་ཤེས་བློ་གྲོས་ཅན། །རྣམ་པར་ཤེས་པའི་བློ་གྲོས་འདོད་མ་ཡིན། །
en: Pure beings endowed with the intelligence of wisdom Do not long for the intelligence of ordinary consciousness.

source: ཆོས་ཀྱི་བློ་གྲོས་ལྡན་པར་གྱུར་པ་དེ། །ཉོན་མོངས་བློ་གྲོས་སེལ་ཅིང་གཏི་མུག་བྲལ། །
en: “Endowed with intelligence involving Dharma, They dispel intelligence involving afflictive emotion and are freed from delusion.

source: ཤེས་རབ་དང་ནི་ཐབས་ཀྱི་ཚུལ་ཤེས་པ། །དེ་ནི་རྒྱལ་བའི་བྱང་ཆུབ་འགལ་མི་བྱེད། །
en: Knowing the ways of insight and method, They do not contravene the awakening of the Victor.

source: དེ་ནི་སངས་རྒྱས་འགྱུར་བའི་བློ་གྲོས་ལྡན། །ཉན་ཐོས་འགྱུར་མིན་རང་རྒྱལ་འགྱུར་མ་ཡིན། །
en: “Their intelligence is focused on becoming buddhas, Not on becoming śrāvakas or pratyekabuddhas.

source: རྟག་ཏུ་རླབས་ཆེན་བློ་གྲོས་ཅན་ཡིན་གྱི། །དེ་ནི་བློ་གྲོས་ཆུང་ངུ་འདོད་མ་ཡིན། །
en: They are constantly endowed with tremendous intelligence And do not long for intelligence of a lesser kind.

source: སངས་རྒྱས་བློ་གྲོས་རྟག་ཏུ་ལྡན་ཡིན་གྱི། །བདུད་ཀྱི་བློ་གྲོས་སུ་ནི་འགྱུར་མ་ཡིན། །
en: “They are perpetually endowed with the intelligence of a buddha, Which does not turn into the intelligence of Māra.

source: བློ་གྲོས་ལྡན་པ་སྙིང་རྗེ་ཆེར་གཞོལ་གྱི། །སེམས་ཅན་གང་ལའང་རྣམ་པར་འཚེ་བ་མིན། །
en: These intelligent ones are committed to great compassion, Not to harming any beings in any way.

source: ཆོས་འགའ་བསྟན་པ་གང་ཡིན་དེ་ལ་ནི། །ཐེ་ཚོམ་མེད་ཅིང་རྟོགས་པར་ཁོང་དུ་ཆུད། །
en: “Bodhisattvas comprehend and are free from hesitation Regarding any of the teachings that the Buddha has taught.

source: དེ་ནི་དགོངས་ཏེ་གསུང་ལ་མཁས་འགྱུར་ཞིང་། །སེམས་ཅན་སྤྱོད་པ་རྣམས་ལ་རྟོགས་དང་ལྡན། །
en: They become skilled in communicating their intended meanings, And they understand the conduct of sentient beings.

source: སོ་སོ་ཡང་དག་རིག་ལ་རྟོགས་ལྡན་ཞིང་། །དེ་ཡི་ཤེས་པ་འཇུག་པ་ཆགས་པ་མེད། །
en: “They comprehend discriminating knowledge And have no attachment to the application of such knowing.

source: རྐྱེན་བྱུང་བྱེད་པ་པོ་དང་རྣམ་བྲལ་བར། །རྟེན་པའི་ཆོས་རྣམས་དག་ནི་རབ་ཏུ་ཤེས། །
en: They know well that conditioned phenomena Are dependently arisen and have no creator.

source: དེ་ནི་སྣྲེལ་ཞིའི་རྒྱུ་ལ་མཁས་གྱུར་ཅིང་། །སྤྱིའུ་ཚུགས་ཚུལ་ནི་རྟོགས་པར་ཁོང་དུ་ཆུད། །
en: “They are learned in the causes of nonsequential progression, And they comprehend the ways of reverse progression.

source: སངས་རྒྱས་ཀྱི་ནི་ཆོས་རྣམས་ཇི་སྙེད་པ། །ཐམས་ཅད་ཀྱང་ནི་རྟོགས་པར་ཁོང་དུ་ཆུད། །
en: They attain comprehension Of the whole spectrum of the teachings of the Buddha.

source: འཇིག་རྟེན་པ་ཡི་ཆོས་ཀྱི་སྣང་བ་ཡིས། །ལྷ་མི་རྣམས་ཀྱི་ལས་ཀྱི་བྱ་བ་ཤེས། །
en: “By means of their illumination of mundane phenomena, Bodhisattvas know the deeds of gods and humans.

source: འཇིག་རྟེན་ལས་ནི་འདས་པའི་ཡེ་ཤེས་ཀྱིས། །ཤེས་རབ་སྣང་བ་དང་ནི་ལྡན་པ་ཡིན། །
en: Through supramundane wisdom, They are endowed with the illumination of insight.

source: ཁ་ན་མ་ཐོར་བཅས་དང་མ་ཐོ་མེད། །ཡེ་ཤེས་རབ་ཏུ་གསལ་བ་ཆེན་པོ་འཇུག །
en: They apply exceedingly bright wisdom Both to those with and without fault.

source: ལམ་ནི་ཤིན་ཏུ་བསྒོམས་པར་གྱུར་པའི་ཕྱིར། །རྟག་ཏུ་འབྲས་བུ་ཡོད་པར་ཆོས་སྟོན་ཏོ། །
en: “Because bodhisattvas have cultivated the path, They always teach the Dharma that bears fruit.

source: ཟག་པར་བཅས་དང་ཟག་པ་མེད་པ་ཡི། །ཆོས་ལ་དེ་ཡི་སྣང་བ་རབ་ཏུ་འཇུག །
en: They apply its illumination Both to contaminated and uncontaminated phenomena.

source: དེ་ནི་ཟག་པ་ཐམས་ཅད་སྤོང་བྱེད་ཅིང་། །ལྷ་དང་མི་རྣམས་ཀྱི་ནི་དོན་ཀྱང་བྱེད། །
en: They abandon all contaminants And thus benefit both gods and humans.

source: འདུས་མ་བྱས་དང་འདུས་བྱས་ཆོས་རྣམས་ལ། །དེ་ཡི་ཤེས་པ་རྟག་ཏུ་རབ་ཏུ་འཇུག །
en: “Bodhisattvas constantly apply their knowledge Both to conditioned and unconditioned phenomena.

source: དེ་ནི་དེ་ཡིས་དྲི་བྲལ་རབ་རིབ་མེད། །
en: They are thereby free from stains and without distorted vision.

source: སྐྱོན་མེད་ཐོབ་ནས་སྤྱད་པ་རྣམས་ཀྱང་སྤྱོད། །
en: Having attained flawlessness, they likewise engage in good conduct.

source: རྣམ་པར་བྱང་དང་ཀུན་ནས་ཉོན་མོངས་ལ། །དེ་ཡི་ཤེས་པ་སྒྲིབ་པ་མེད་པ་འཇུག །
en: “Bodhisattvas apply their unobscured knowledge To the factors of purification and pollution.

source: རང་བཞིན་གྱིས་ནི་སེམས་འོད་གསལ་བ་དང་། །ཀུན་ནས་ཉོན་མོངས་པ་ཡི་ཚུལ་ཡང་ཤེས། །
en: Thus they understand that the mind is luminous by nature And the ways in which it becomes polluted.

source: ཇི་ལྟར་མྱ་ངན་འདས་པར་གྱུར་པ་ནི། །སྐྱེ་བ་མེད་ཅིང་འབྱུང་བ་མེད་པར་ཤེས། །
en: “Bodhisattvas know how the state of nirvāṇa Is unborn and without origination.

source: འདི་འདྲ་འདི་ནི་ཐེག་པ་ཆེན་པོ་ལ། །ཆོས་ཀྱི་སྣང་བ་མཐའ་ཡས་གྱུར་པ་ཡིན། །
en: In the same way, in the Great Vehicle, The illuminations of phenomena are infinite.

source: དེ་ནི་བརྒྱད་པ་ཡི་ནི་ཤེས་པ་དང་། །རྒྱུན་དུ་ཞུགས་ལ་ཤེས་པ་འཇུག་པ་དང་། །ལན་ཅིག་ཕྱིར་འོང་བ་ཡི་ཤེས་པ་དང་། །ཕྱིར་མི་འོང་ལ་ཤེས་པ་འཇུག་པ་དང་། །
en: “Bodhisattvas pursue the knowledge of one with eight existences remaining And the knowledge of a stream enterer. They pursue the knowledge of a once-returner And the knowledge of a non-returner.

source: དེ་ནི་དགྲ་བཅོམ་པ་དང་རང་རྒྱལ་དང་། །འཇིག་རྟེན་མགོན་པོ་བྱང་ཆུབ་སེམས་དཔའ་དག །
en: “They pursue the knowledge and accomplishments Of all the arhats and pratyekabuddhas,

source: ཀུན་ལ་དེ་ཡི་ཤེས་དང་སྒྲུབ་པ་རྣམས། །ལྷག་མ་ལུས་པ་མེད་པར་རབ་ཏུ་འཇུག །
en: Of all the world protectors and the bodhisattvas, Without a single exception.

source: གང་གིས་འབྲས་བུ་འཐོབ་པར་འགྱུར་བ་དང་། །འཁྲུགས་མེད་དོན་དམ་ངེས་པར་འབྱུང་འགྱུར་བ། །
en: “Those heroes who Attain the fruitions, Who gain deliverance in the imperturbable ultimate,

source: དེ་ལ་རབ་བསྒོམས་སྨྲ་བ་དཔའ་བོ་རྣམས། །བདེན་པའི་སྣང་བ་དག་དང་ལྡན་པ་ཡིན། །
en: And who disclose its cultivation embody the illumination of the truths.

source: བདེན་པ་དག་ནི་བསྒོམ་པ་བྱས་པས་ན། །སྐྱོན་མེད་འཇུག་དང་འབྲས་བུ་དང་པོ་འཐོབ། །
en: “Since they have cultivated those truths, They enter a state of flawlessness and attain the first fruition.

source: གཉིས་དང་གསུམ་དང་དེ་བཞིན་བཞི་པ་དང་། །རང་རྒྱལ་རྣམས་ཀྱི་འབྲས་བུ་ཐོབ་པར་འགྱུར། །
en: They also attain the second, the third, the fourth, And likewise the fruition of pratyekabuddhahood.

source: བསྒོམ་པ་གང་གིས་སུ་ནི་སྨྲ་བའི་སྟག །དེ་དག་བཟོད་པ་དག་ནི་འཐོབ་འགྱུར་དང་། །གང་གིས་རྒྱལ་བ་བྱང་ཆུབ་འཚང་རྒྱ་བ། །བདེན་པ་དེ་དག་ལ་ནི་སྣང་བར་འགྱུར། །
en: “Those tigers of speech who through cultivation Attain acceptance And attain the awakening of the victors Will illuminate those truths.

source: ལྷ་ཡི་མིག་གིས་སུ་ནི་དེ་ཡིས་ཀྱང་། །གཟུགས་ཀྱི་རྣམ་པ་དག་ནི་ཐམས་ཅད་མཐོང་། །
en: “Bodhisattvas see all aspects of form With the divine eye.

source: ལྷ་ཡི་རྣ་བ་ངེས་པར་རྟོགས་པ་ཡིས། །ཕྱོགས་བཅུ་དག་གི་སྒྲ་རྣམས་རྟོགས་པར་འགྱུར། །
en: They perceive the sounds of the ten directions Through the discernment of the divine ear.

source: སྔོན་གྱི་གནས་ཤེས་པ་ཡི་སྣང་བ་ཡིས། །བསྐལ་པ་ཁྲག་ཁྲིག་དག་ནི་རྗེས་སུ་དྲན། །
en: “Through the illumination of the knowledge of previous existences, They recall billions of eons.

source: འོད་གསལ་བ་ཡི་ཤེས་པའི་སྣང་བ་ཡིས། །གཞན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་རྣམས་ལ་མཁས། །
en: Through the illumination of the knowledge of luminosity, They have knowledge of the mental conduct of others.

source: རྫུ་འཕྲུལ་གྱི་ནི་ཤེས་པའི་སྣང་བ་ཡིས། །ཕྱོགས་བཅུའི་ཞིང་ནི་ཁྲག་ཁྲིག་རྣམས་སུ་འགྲོ། །
en: “Through the illumination of the knowledge of miracles, They move throughout billions of buddhafields in the ten directions.

source: ཟག་པ་མེད་པའི་ཤེས་པའི་སྣང་བ་ནི། །ནམ་མཁའ་དང་ནི་མཚུངས་ཤིང་འདྲ་བ་ཡིན། །
en: Their illumination of uncontaminated knowledge Is similar to space.

source: བསོད་ནམས་ཀྱི་ནི་སྣང་བ་མཐའ་ཡས་པའི། །མངོན་ཤེས་ཐོག་མ་འགྲོ་བ་ཉེ་བར་འགྲོ། །
en: “Through the meritorious illumination of boundless superknowledge, Bodhisattvas first approach beings,

source: དེ་ཡི་ཤེས་པ་ཆགས་པ་མེད་པ་ཡིས། །འགྲོ་བའི་དོགས་པ་དག་ནི་གཅོད་པར་བྱེད། །
en: And then, through dispassionate knowledge of them, They eliminate the doubts of those beings.

source: ནན་ཏན་སྙིང་པོར་བྱེད་པའི་རྣལ་འབྱོར་པ། །དྲན་དང་བློ་གྲོས་རྟོགས་དང་ཆོས་ཤེས་སྣང་། །བདེན་པ་ཡི་ནི་སྣང་བ་མཐའ་ཡས་ཏེ། །མངོན་པར་ཤེས་པའི་སྣང་བར་གྱུར་པ་ཡིན། །
en: “Yogic practitioners who apply themselves vigorously Thus gain the illuminations of mindfulness, Intelligence, comprehension, phenomena, and knowledge, The boundless illumination of truth, And the illumination of superknowledge.

source: སྒྲུབ་པས་ཡེ་ཤེས་དང་ནི་ཤེས་རབ་དང་། །རྒྱ་ཆེན་བློ་དང་སྤོབས་པ་མཐའ་ཡས་དང་། །ཡང་དག་ལྟ་བ་དང་ནི་ལྷག་མཐོང་དང་། །ཤིན་ཏུ་འཁྲུགས་པ་མེད་པ་མཐར་ཐུག་གྱུར། །
en: “Accomplishment culminates in wisdom and insight, Vast understanding and boundless eloquence, Correct view and special insight, And total imperturbability.

source: སྣང་བ་ཤིན་ཏུ་རྣམ་པར་དག་པ་བརྒྱད། །འདི་དག་མཐུ་ཆེན་གང་ལ་ཡོད་པ་ནི། །རེ་ཞིག་བྱང་ཆུབ་ཐོབ་པར་མ་གྱུར་ཀྱང་། །དེ་ནི་སངས་རྒྱས་མཛད་པ་བྱེད་པར་འགྱུར། །
en: “Even though those powerful beings In whom these eight pure illuminations are present Might not obtain awakening right now, They will nonetheless perform buddha activities.”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་བཅུ་དྲུག་གིས་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ། །
en: “Son of noble family, there are sixteen ways in which bodhisattvas give rise to great bodhisattva compassion for sentient beings.

source: བཅུ་དྲུག་གང་ཞེ་ན།
en: What are these sixteen ways?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ།
en: Son of noble family, bodhisattvas give rise to a bodhisattva’s great compassion for sentient beings while thinking as follows:

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་འཇིག་ཚོགས་ལ་ལྟ་བས་བཅིངས་པ། ལྟ་བ་སྣ་ཚོགས་དང་འདྲེས་པ་དག་སྟེ།
en: “ ‘Alas, these beings are fettered by personalistic views, and they are mixed up with various kinds of wrong views.

source: ལྟ་བ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་དེ་དག་ལ་ཆོས་བསྟན་པར་བྱའོ་
en: To help them abandon all those views, I shall teach them the Dharma.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཡོད་པ་མ་ཡིན་པའི་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་ནས་མི་རྟག་པ་ལ་རྟག་པར་འདུ་ཤེས། སྡུག་བསྔལ་བ་ལ་བདེ་བར་འདུ་ཤེས། བདག་མེད་པ་ལ་བདག་ཏུ་འདུ་ཤེས། མི་སྡུག་པ་ལ་སྡུག་པར་འདུ་ཤེས་པ་དག་སྟེ
en: “ ‘Alas, these beings, due to misapprehension about what is actually the case, perceive what is impermanent to be permanent, what is painful to be pleasant, what is no self to be a self, and what is repulsive to be attractive.

source: ཕྱིན་ཅི་ལོག་ཐམས་ཅད་སྤང་བའི་ཕྱིར་དེ་དག་ལ་ཆོས་བསྟན་པར་བྱའོ་
en: To help them abandon all misapprehensions, I shall teach them the Dharma.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་གནས་པ། དངོས་པོ་མེད་པ་ལ་དངོས་པོར་འདུ་ཤེས་པ་དག་སྟེ
en: “ ‘Alas, these beings are stuck grasping onto I and mine, and they perceive what is insubstantial to be substantial.

source: ངར་འཛིན་པ་དང་ང་ཡིར་འཛིན་པ་སྤང་བའི་ཕྱིར་དེ་དག་ལ་ཆོས་བསྟན་པར་བྱའོ་
en: To help them abandon grasping onto I and mine, I shall teach them the Dharma.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་སྒྲིབ་པ་ལྔས་བསྒྲིབས་ཏེ་འདོད་པའི་ཟུག་རྔུས་ཟུག་པ། ཁོང་ཁྲོ་བ་མང་བ། རྨུགས་པ་དང་གཉིད་ལ་ཆགས་པ། དམ་པ་མ་ཡིན་པ་ལ་འགྱོད་པ་ཀུན་ནས་ལངས་པ། ཟབ་མོའི་ཆོས་ལ་ངེས་པ་མ་ཐོབ་པ་དག་སྟེ
en: “ ‘Alas, these beings are obstructed by the five obstructions: they are tormented by sharp pangs of desire, they are very aggressive, they are attached to fogginess and sleep, they are excited and regretful toward ignoble objects, and they are unable to reach certainty about the holy Dharma.

source: སྒྲིབ་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་དེ་དག་ལ་ཆོས་བསྟན་པར་བྱའོ་
en: To help them abandon all obstructions, I shall teach them the Dharma.

source: ཀྱེ་མ་སེམས་ཅན་འདི་ནི་སྐྱེ་མཆེད་དྲུག་གིས་ཆགས་པས་ཆགས་ཏེ
en: “ ‘Alas, these beings are bound by attachment to the six sense fields:

source: མིག་གིས་གཟུགས་རྣམས་མཐོང་ནས་མཚན་མར་འཛིན་ཅིང་མངོན་རྟགས་སུ་འཛིན་པ་ཡིན། རྣ་བས་སྒྲ་ཐོས། སྣས་དྲི་སྣམས། ལྕེས་རོ་མྱངས། ལུས་ཀྱིས་རེག་བྱ་རྣམས་ལ་རེག །ཡིད་ཀྱིས་ཆོས་རྣམས་རྣམ་པར་ཤེས་ནས་མཚན་མར་འཛིན་ཅིང་མངོན་རྟགས་སུ་འཛིན་པ་དག་ཡིན་ཏེ།
en: when they see form with their eyes, they cling to its marks and characteristics, and when they hear sounds with their ears, experience smells with their noses, experience tastes with their tongues, feel sensations with their bodies, and notice phenomena with their mental faculties, they cling to their marks and characteristics.

source: སྐྱེ་མཆེད་དྲུག་གིས་ཆགས་པ་སྤང་བའི་ཕྱིར་དེ་དག་ལ་ཆོས་བསྟན་པར་བྱའོ་
en: To help them abandon attachment to the six sense fields, I shall teach them the Dharma.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ང་རྒྱལ་དང་། ལྷག་པའི་ང་རྒྱལ་དང་། ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་དང་། མངོན་པའི་ང་རྒྱལ་དང་། ཆུང་ཟད་སྙམ་པའི་ང་རྒྱལ་དང་། ལོག་པའི་ང་རྒྱལ་གྱིས་བཅོམ་པས།
en: “ ‘Alas, these beings are overcome by pride, the pride of superiority, excessive pride, the pride that thinks “I am,” manifest pride, the inverted pride of self-abasement, and mistaken pride.

source: ཆུང་ངུ་དག་པས་བདག་ཅག་ཆེའོ་སྙམ་དུ་བདག་ལ་རློམ་སེམས་སུ་བྱེད་པ། མཚུངས་པ་དག་པས་ནི་བདག་ཅག་ཆེའོ་སྙམ་དུ་བདག་ལ་རློམ་སེམས་སུ་བྱེད་པ་དང་། ཆེས་ཆེ་བ་དག་པས་ཀྱང་བདག་ཅག་ཆེས་ཆེའོ་སྙམ་དུ་བདག་ལ་རློམ་སེམས་སུ་བྱེད་པ།
en: Since they are conceited about themselves, they think “We are greater than those who are inferior,” “We are greater than those who are our equals,” and “We are even greater than those who are greater.”

source: གཟུགས་ལ་བདག་ཏུ་ཁས་ལེན་པ་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་བདག་ཏུ་ཁས་ལེན་པ། མ་ཐོབ་པར་བདག་ལ་ཐོབ་པ་སྙམ་དུ་ཤེས་པ།
en: They take their five aggregates, from form to consciousness, as constituting I. They consider what has not been attained and think “I have attained it.”

source: བདག་ཅག་ནི་འཕགས་པའོ་སྙམ་དུ་བདག་ལ་སེམས་པ། ལོག་པའི་ལྟ་བ་ལ་ཡང་དག་པའི་ལྟ་བར་མོས་པ་དག་སྟེ
en: They reflect upon themselves and think “We are superior.” And they believe that their wrong views are correct.

source: ང་རྒྱལ་གྱི་རྣམ་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་དེ་དག་ལ་ཆོས་བསྟན་པར་བྱའོ་
en: To help them abandon all forms of pride, I shall teach them the Dharma.
